Revit 2026 API

# DocumentReloadedLatestEventArgsLocation Property

---

Full path of the central model which is to be operated.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Location { get; set; }
```
```vb
Public Property Location As String
	Get
	Set
```
```cpp
public:
property String^ Location {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Location : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.

#### Reference

DocumentReloadedLatestEventArgs Class

Autodesk.Revit.DB.Events Namespace